package ru.study.chapter_06._06_littles_law;

/**
 * Закон Литтла - объясняет, как рассчитать, сколько запросов должно обрабатываться одновременно, чтобы обеспечить
 * требуемую пропускную способность при конкретном уровне задержки.
 * Джон Даттон Конант Литтл (1 февраля 1928 – 27 сентября 2024) был американским исследователем операций, который был
 * профессором Массачусетского технологического института. Он был наиболее известен своим результатом в области
 * исследования операций, закона Литтла.
 */
public class LittlesLaw {
    /*
     N = X * R, где
     N - среднее количество запросов.
     X - число пользователей в секунду.
     R - среднее время отклика или задержки.
     */
}
